<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>O01-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>terraform</td>

<td>Outbound "To Any allow Any service" rules to Public IPs</td>

</tr>
<tr>

<td>I01-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>terraform</td>

<td>"Any" service can enter your network from Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>terraform</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  O01-I-SG</summary> 

### **Title:**
Outbound "To Any allow Any service" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with service Any" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  I01-NI-SG</summary> 

### **Title:**
"Any" service can enter your network from Private IPs

### **Description:**
Allowing the "Any" service to enter your network is extremely risky since the "Any" service includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs.

### **Recommendation:**
Review all the rules that allow inbound traffic with "Any" service, and limit them to those services you actually require.  

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>10.10.0.0/16</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>10.11.0.0/16</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>10.10.0.0/16</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>0</td>

  <td>0</td>

  <td>-1</td>

  <td>10.11.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

data.aws_availability_zones.available: Reading...
data.aws_ami.amazon-linux-2: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
data.aws_ami.amazon-linux-2: Read complete after 6s [id=ami-0af7a5885e3ff0439]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.anfw_alert_log_group will be created
  + resource "aws_cloudwatch_log_group" "anfw_alert_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/network-firewall/alert"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_ec2_transit_gateway.tgw will be created
  + resource "aws_ec2_transit_gateway" "tgw" {
      + amazon_side_asn                    = 64512
      + arn                                = (known after apply)
      + association_default_route_table_id = (known after apply)
      + auto_accept_shared_attachments     = "disable"
      + default_route_table_association    = "enable"
      + default_route_table_propagation    = "enable"
      + dns_support                        = "enable"
      + id                                 = (known after apply)
      + multicast_support                  = "disable"
      + owner_id                           = (known after apply)
      + propagation_default_route_table_id = (known after apply)
      + tags                               = {
          + "Name" = "transit-gateway"
        }
      + tags_all                           = {
          + "Name" = "transit-gateway"
        }
      + vpn_ecmp_support                   = "enable"
    }

  # aws_ec2_transit_gateway_route.spoke_route_table_default_route will be created
  + resource "aws_ec2_transit_gateway_route" "spoke_route_table_default_route" {
      + blackhole                      = false
      + destination_cidr_block         = "0.0.0.0/0"
      + id                             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table.inspection_route_table will be created
  + resource "aws_ec2_transit_gateway_route_table" "inspection_route_table" {
      + arn                             = (known after apply)
      + default_association_route_table = (known after apply)
      + default_propagation_route_table = (known after apply)
      + id                              = (known after apply)
      + tags                            = {
          + "Name" = "inspection-route-table"
        }
      + tags_all                        = {
          + "Name" = "inspection-route-table"
        }
      + transit_gateway_id              = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table.spoke_route_table will be created
  + resource "aws_ec2_transit_gateway_route_table" "spoke_route_table" {
      + arn                             = (known after apply)
      + default_association_route_table = (known after apply)
      + default_propagation_route_table = (known after apply)
      + id                              = (known after apply)
      + tags                            = {
          + "Name" = "spoke-route-table"
        }
      + tags_all                        = {
          + "Name" = "spoke-route-table"
        }
      + transit_gateway_id              = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_association.inspection_vpc_tgw_attachment_rt_association will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "inspection_vpc_tgw_attachment_rt_association" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_association.spoke_vpc_a_tgw_attachment_rt_association will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "spoke_vpc_a_tgw_attachment_rt_association" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_association.spoke_vpc_b_tgw_attachment_rt_association will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "spoke_vpc_b_tgw_attachment_rt_association" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_propagation.inspection_route_table_propagate_spoke_vpc_a will be created
  + resource "aws_ec2_transit_gateway_route_table_propagation" "inspection_route_table_propagate_spoke_vpc_a" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_propagation.inspection_route_table_propagate_spoke_vpc_b will be created
  + resource "aws_ec2_transit_gateway_route_table_propagation" "inspection_route_table_propagate_spoke_vpc_b" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_route_table_propagation.spoke_route_table_propagate_inspection_vpc will be created
  + resource "aws_ec2_transit_gateway_route_table_propagation" "spoke_route_table_propagate_inspection_vpc" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.inspection_vpc_tgw_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "inspection_vpc_tgw_attachment" {
      + appliance_mode_support                          = "enable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = (known after apply)
      + tags                                            = {
          + "Name" = "inspection-vpc-attachment"
        }
      + tags_all                                        = {
          + "Name" = "inspection-vpc-attachment"
        }
      + transit_gateway_default_route_table_association = false
      + transit_gateway_default_route_table_propagation = true
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.spoke_vpc_a_tgw_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "spoke_vpc_a_tgw_attachment" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = (known after apply)
      + tags                                            = {
          + "Name" = "spoke-vpc-a-attachment"
        }
      + tags_all                                        = {
          + "Name" = "spoke-vpc-a-attachment"
        }
      + transit_gateway_default_route_table_association = false
      + transit_gateway_default_route_table_propagation = true
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.spoke_vpc_b_tgw_attachment will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "spoke_vpc_b_tgw_attachment" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = (known after apply)
      + tags                                            = {
          + "Name" = "spoke-vpc-b-attachment"
        }
      + tags_all                                        = {
          + "Name" = "spoke-vpc-b-attachment"
        }
      + transit_gateway_default_route_table_association = false
      + transit_gateway_default_route_table_propagation = true
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # aws_eip.inspection_vpc_nat_gw_eip[0] will be created
  + resource "aws_eip" "inspection_vpc_nat_gw_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_eip.inspection_vpc_nat_gw_eip[1] will be created
  + resource "aws_eip" "inspection_vpc_nat_gw_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_eip.inspection_vpc_nat_gw_eip[2] will be created
  + resource "aws_eip" "inspection_vpc_nat_gw_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_iam_instance_profile.instance_profile will be created
  + resource "aws_iam_instance_profile" "instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "session-manager-instance-profile"
      + path        = "/"
      + role        = "session-manager-instance-profile-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.instance_role will be created
  + resource "aws_iam_role" "instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = {
                  + Action    = "sts:AssumeRole"
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "ec2.amazonaws.com"
                    }
                }
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "session-manager-instance-profile-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.instance_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "instance_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "session-manager-instance-profile-role"
    }

  # aws_instance.spoke_vpc_a_host will be created
  + resource "aws_instance" "spoke_vpc_a_host" {
      + ami                                  = "ami-0af7a5885e3ff0439"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "session-manager-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "spoke-vpc-a/host"
        }
      + tags_all                             = {
          + "Name" = "spoke-vpc-a/host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "eec02a282b02243b6f8fd3ac2eee22d037e0f3ab"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.spoke_vpc_b_host will be created
  + resource "aws_instance" "spoke_vpc_b_host" {
      + ami                                  = "ami-0af7a5885e3ff0439"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "session-manager-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "spoke-vpc-b/host"
        }
      + tags_all                             = {
          + "Name" = "spoke-vpc-b/host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "eec02a282b02243b6f8fd3ac2eee22d037e0f3ab"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.inspection_vpc_igw will be created
  + resource "aws_internet_gateway" "inspection_vpc_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "inspection-vpc/internet-gateway"
        }
      + tags_all = {
          + "Name" = "inspection-vpc/internet-gateway"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.inspection_vpc_nat_gw[0] will be created
  + resource "aws_nat_gateway" "inspection_vpc_nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "inspection-vpc/eu-west-1a/nat-gateway"
        }
      + tags_all             = {
          + "Name" = "inspection-vpc/eu-west-1a/nat-gateway"
        }
    }

  # aws_nat_gateway.inspection_vpc_nat_gw[1] will be created
  + resource "aws_nat_gateway" "inspection_vpc_nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "inspection-vpc/eu-west-1b/nat-gateway"
        }
      + tags_all             = {
          + "Name" = "inspection-vpc/eu-west-1b/nat-gateway"
        }
    }

  # aws_nat_gateway.inspection_vpc_nat_gw[2] will be created
  + resource "aws_nat_gateway" "inspection_vpc_nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "inspection-vpc/eu-west-1c/nat-gateway"
        }
      + tags_all             = {
          + "Name" = "inspection-vpc/eu-west-1c/nat-gateway"
        }
    }

  # aws_networkfirewall_firewall.inspection_vpc_anfw will be created
  + resource "aws_networkfirewall_firewall" "inspection_vpc_anfw" {
      + arn                 = (known after apply)
      + delete_protection   = false
      + firewall_policy_arn = (known after apply)
      + firewall_status     = (known after apply)
      + id                  = (known after apply)
      + name                = "NetworkFirewall"
      + tags_all            = (known after apply)
      + update_token        = (known after apply)
      + vpc_id              = (known after apply)

      + subnet_mapping {
          + subnet_id = (known after apply)
        }
      + subnet_mapping {
          + subnet_id = (known after apply)
        }
      + subnet_mapping {
          + subnet_id = (known after apply)
        }
    }

  # aws_networkfirewall_firewall_policy.anfw_policy will be created
  + resource "aws_networkfirewall_firewall_policy" "anfw_policy" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "firewall-policy"
      + tags_all     = (known after apply)
      + update_token = (known after apply)

      + firewall_policy {
          + stateless_default_actions          = [
              + "aws:forward_to_sfe",
            ]
          + stateless_fragment_default_actions = [
              + "aws:forward_to_sfe",
            ]

          + stateful_rule_group_reference {
              + resource_arn = (known after apply)
            }
          + stateful_rule_group_reference {
              + resource_arn = (known after apply)
            }
          + stateful_rule_group_reference {
              + resource_arn = (known after apply)
            }

          + stateless_rule_group_reference {
              + priority     = 20
              + resource_arn = (known after apply)
            }
        }
    }

  # aws_networkfirewall_logging_configuration.anfw_alert_logging_configuration will be created
  + resource "aws_networkfirewall_logging_configuration" "anfw_alert_logging_configuration" {
      + firewall_arn = (known after apply)
      + id           = (known after apply)

      + logging_configuration {
          + log_destination_config {
              + log_destination      = (known after apply)
              + log_destination_type = "S3"
              + log_type             = "FLOW"
            }
          + log_destination_config {
              + log_destination      = {
                  + "logGroup" = "/aws/network-firewall/alert"
                }
              + log_destination_type = "CloudWatchLogs"
              + log_type             = "ALERT"
            }
        }
    }

  # aws_networkfirewall_rule_group.block_domains will be created
  + resource "aws_networkfirewall_rule_group" "block_domains" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "block-domains"
      + tags_all     = (known after apply)
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rule_variables {
              + ip_sets {
                  + key = "HOME_NET"

                  + ip_set {
                      + definition = [
                          + "10.10.0.0/16",
                          + "10.11.0.0/16",
                        ]
                    }
                }
            }

          + rules_source {
              + rules_source_list {
                  + generated_rules_type = "DENYLIST"
                  + target_types         = [
                      + "HTTP_HOST",
                      + "TLS_SNI",
                    ]
                  + targets              = [
                      + ".facebook.com",
                      + ".twitter.com",
                    ]
                }
            }
        }
    }

  # aws_networkfirewall_rule_group.block_public_dns_resolvers will be created
  + resource "aws_networkfirewall_rule_group" "block_public_dns_resolvers" {
      + arn          = (known after apply)
      + capacity     = 1
      + id           = (known after apply)
      + name         = "block-public-dns"
      + tags_all     = (known after apply)
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {

          + rules_source {

              + stateful_rule {
                  + action = "DROP"

                  + header {
                      + destination      = "ANY"
                      + destination_port = "ANY"
                      + direction        = "ANY"
                      + protocol         = "DNS"
                      + source           = "ANY"
                      + source_port      = "ANY"
                    }

                  + rule_option {
                      + keyword  = "sid:50"
                      + settings = []
                    }
                }
            }
        }
    }

  # aws_networkfirewall_rule_group.drop_icmp will be created
  + resource "aws_networkfirewall_rule_group" "drop_icmp" {
      + arn          = (known after apply)
      + capacity     = 1
      + id           = (known after apply)
      + name         = "drop-icmp"
      + tags_all     = (known after apply)
      + type         = "STATELESS"
      + update_token = (known after apply)

      + rule_group {

          + rules_source {

              + stateless_rules_and_custom_actions {

                  + stateless_rule {
                      + priority = 1

                      + rule_definition {
                          + actions = [
                              + "aws:drop",
                            ]

                          + match_attributes {
                              + protocols = [
                                  + 1,
                                ]

                              + destination {
                                  + address_definition = "0.0.0.0/0"
                                }

                              + source {
                                  + address_definition = "0.0.0.0/0"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # aws_networkfirewall_rule_group.drop_non_http_between_vpcs will be created
  + resource "aws_networkfirewall_rule_group" "drop_non_http_between_vpcs" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "drop-non-http-between-vpcs"
      + tags_all     = (known after apply)
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rule_variables {
              + ip_sets {
                  + key = "SPOKE_VPCS"

                  + ip_set {
                      + definition = [
                          + "10.10.0.0/16",
                          + "10.11.0.0/16",
                        ]
                    }
                }
            }

          + rules_source {
              + rules_string = <<-EOT
                          drop tcp $SPOKE_VPCS any <> $SPOKE_VPCS any (msg:"Blocked TCP that is not HTTP"; flow:established; app-layer-protocol:!http; sid:100; rev:1;)
                          drop ip $SPOKE_VPCS any <> $SPOKE_VPCS any (msg: "Block non-TCP traffic."; ip_proto:!TCP;sid:200; rev:1;)
                EOT
            }
        }
    }

  # aws_route_table.inspection_vpc_firewall_subnet_route_table[0] will be created
  + resource "aws_route_table" "inspection_vpc_firewall_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = (known after apply)
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1a/firewall-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1a/firewall-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_firewall_subnet_route_table[1] will be created
  + resource "aws_route_table" "inspection_vpc_firewall_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = (known after apply)
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1b/firewall-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1b/firewall-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_firewall_subnet_route_table[2] will be created
  + resource "aws_route_table" "inspection_vpc_firewall_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = (known after apply)
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1c/firewall-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1c/firewall-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_public_subnet_route_table[0] will be created
  + resource "aws_route_table" "inspection_vpc_public_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1a/public-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1a/public-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_public_subnet_route_table[1] will be created
  + resource "aws_route_table" "inspection_vpc_public_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1b/public-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1b/public-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_public_subnet_route_table[2] will be created
  + resource "aws_route_table" "inspection_vpc_public_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/8"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1c/public-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1c/public-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_tgw_subnet_route_table[0] will be created
  + resource "aws_route_table" "inspection_vpc_tgw_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1a/tgw-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1a/tgw-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_tgw_subnet_route_table[1] will be created
  + resource "aws_route_table" "inspection_vpc_tgw_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1b/tgw-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1b/tgw-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.inspection_vpc_tgw_subnet_route_table[2] will be created
  + resource "aws_route_table" "inspection_vpc_tgw_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = (known after apply)
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "inspection-vpc/eu-west-1c/tgw-subnet-route-table"
        }
      + tags_all         = {
          + "Name" = "inspection-vpc/eu-west-1c/tgw-subnet-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.spoke_vpc_a_route_table will be created
  + resource "aws_route_table" "spoke_vpc_a_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = (known after apply)
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "spoke-vpc-a/route-table"
        }
      + tags_all         = {
          + "Name" = "spoke-vpc-a/route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.spoke_vpc_b_route_table will be created
  + resource "aws_route_table" "spoke_vpc_b_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = (known after apply)
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "spoke-vpc-b/route-table"
        }
      + tags_all         = {
          + "Name" = "spoke-vpc-b/route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_firewall_subnet_route_table_association[0] will be created
  + resource "aws_route_table_association" "inspection_vpc_firewall_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_firewall_subnet_route_table_association[1] will be created
  + resource "aws_route_table_association" "inspection_vpc_firewall_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_firewall_subnet_route_table_association[2] will be created
  + resource "aws_route_table_association" "inspection_vpc_firewall_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_public_subnet_route_table_association[0] will be created
  + resource "aws_route_table_association" "inspection_vpc_public_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_public_subnet_route_table_association[1] will be created
  + resource "aws_route_table_association" "inspection_vpc_public_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_public_subnet_route_table_association[2] will be created
  + resource "aws_route_table_association" "inspection_vpc_public_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_tgw_subnet_route_table_association[0] will be created
  + resource "aws_route_table_association" "inspection_vpc_tgw_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_tgw_subnet_route_table_association[1] will be created
  + resource "aws_route_table_association" "inspection_vpc_tgw_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.inspection_vpc_tgw_subnet_route_table_association[2] will be created
  + resource "aws_route_table_association" "inspection_vpc_tgw_subnet_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_a_route_table_association[0] will be created
  + resource "aws_route_table_association" "spoke_vpc_a_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_a_route_table_association[1] will be created
  + resource "aws_route_table_association" "spoke_vpc_a_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_a_route_table_association[2] will be created
  + resource "aws_route_table_association" "spoke_vpc_a_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_b_route_table_association[0] will be created
  + resource "aws_route_table_association" "spoke_vpc_b_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_b_route_table_association[1] will be created
  + resource "aws_route_table_association" "spoke_vpc_b_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.spoke_vpc_b_route_table_association[2] will be created
  + resource "aws_route_table_association" "spoke_vpc_b_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.anfw_flow_bucket will be created
  + resource "aws_s3_bucket" "anfw_flow_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.anfw_flow_bucket_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "anfw_flow_bucket_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.spoke_vpc_a_endpoint_sg will be created
  + resource "aws_security_group" "spoke_vpc_a_endpoint_sg" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic for SSM/EC2 endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "spoke-vpc-a/sg-ssm-ec2-endpoints"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spoke-vpc-a/sg-ssm-ec2-endpoints"
        }
      + tags_all               = {
          + "Name" = "spoke-vpc-a/sg-ssm-ec2-endpoints"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.spoke_vpc_a_host_sg will be created
  + resource "aws_security_group" "spoke_vpc_a_host_sg" {
      + arn                    = (known after apply)
      + description            = "Allow all traffic from VPCs inbound and all outbound"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                  + "10.11.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "spoke-vpc-a/sg-host"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spoke-vpc-a/sg-host"
        }
      + tags_all               = {
          + "Name" = "spoke-vpc-a/sg-host"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.spoke_vpc_b_endpoint_sg will be created
  + resource "aws_security_group" "spoke_vpc_b_endpoint_sg" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic for SSM/EC2 endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.11.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "spoke-vpc-b/sg-ssm-ec2-endpoints"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spoke-vpc-b/sg-ssm-ec2-endpoints"
        }
      + tags_all               = {
          + "Name" = "spoke-vpc-b/sg-ssm-ec2-endpoints"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.spoke_vpc_b_host_sg will be created
  + resource "aws_security_group" "spoke_vpc_b_host_sg" {
      + arn                    = (known after apply)
      + description            = "Allow all traffic from VPCs inbound and all outbound"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                  + "10.11.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "spoke-vpc-b/sg-host"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "spoke-vpc-b/sg-host"
        }
      + tags_all               = {
          + "Name" = "spoke-vpc-b/sg-host"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.inspection_vpc_firewall_subnet[0] will be created
  + resource "aws_subnet" "inspection_vpc_firewall_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1a/firewall-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1a/firewall-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_firewall_subnet[1] will be created
  + resource "aws_subnet" "inspection_vpc_firewall_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1b/firewall-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1b/firewall-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_firewall_subnet[2] will be created
  + resource "aws_subnet" "inspection_vpc_firewall_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1c/firewall-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1c/firewall-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_public_subnet[0] will be created
  + resource "aws_subnet" "inspection_vpc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1a/public-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1a/public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_public_subnet[1] will be created
  + resource "aws_subnet" "inspection_vpc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1b/public-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1b/public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_public_subnet[2] will be created
  + resource "aws_subnet" "inspection_vpc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1c/public-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1c/public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_tgw_subnet[0] will be created
  + resource "aws_subnet" "inspection_vpc_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1a/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1a/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_tgw_subnet[1] will be created
  + resource "aws_subnet" "inspection_vpc_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.31.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1b/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1b/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.inspection_vpc_tgw_subnet[2] will be created
  + resource "aws_subnet" "inspection_vpc_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.255.32.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "inspection-vpc/eu-west-1c/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "inspection-vpc/eu-west-1c/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_endpoint_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_a_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1a/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1a/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_endpoint_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_a_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1b/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1b/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_endpoint_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_a_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1c/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1c/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_protected_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_a_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1a/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1a/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_protected_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_a_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1b/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1b/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_protected_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_a_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1c/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1c/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_tgw_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_a_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1a/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1a/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_tgw_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_a_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.31.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1b/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1b/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_a_tgw_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_a_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.32.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-a/eu-west-1c/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-a/eu-west-1c/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_endpoint_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_b_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1a/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1a/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_endpoint_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_b_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1b/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1b/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_endpoint_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_b_endpoint_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1c/endpoint-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1c/endpoint-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_protected_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_b_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1a/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1a/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_protected_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_b_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1b/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1b/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_protected_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_b_protected_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1c/protected-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1c/protected-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_tgw_subnet[0] will be created
  + resource "aws_subnet" "spoke_vpc_b_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1a/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1a/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_tgw_subnet[1] will be created
  + resource "aws_subnet" "spoke_vpc_b_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.31.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1b/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1b/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.spoke_vpc_b_tgw_subnet[2] will be created
  + resource "aws_subnet" "spoke_vpc_b_tgw_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.11.32.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "spoke-vpc-b/eu-west-1c/tgw-subnet"
        }
      + tags_all                                       = {
          + "Name" = "spoke-vpc-b/eu-west-1c/tgw-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.inspection_vpc will be created
  + resource "aws_vpc" "inspection_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.255.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "inspection-vpc"
        }
      + tags_all                             = {
          + "Name" = "inspection-vpc"
        }
    }

  # aws_vpc.spoke_vpc_a will be created
  + resource "aws_vpc" "spoke_vpc_a" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "spoke-vpc-a"
        }
      + tags_all                             = {
          + "Name" = "spoke-vpc-a"
        }
    }

  # aws_vpc.spoke_vpc_b will be created
  + resource "aws_vpc" "spoke_vpc_b" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.11.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "spoke-vpc-b"
        }
      + tags_all                             = {
          + "Name" = "spoke-vpc-b"
        }
    }

  # aws_vpc_endpoint.spoke_vpc_a_ec2_messages_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_a_ec2_messages_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.spoke_vpc_a_ssm_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_a_ssm_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.spoke_vpc_a_ssm_messages_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_a_ssm_messages_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.spoke_vpc_b_ec2_messages_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_b_ec2_messages_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.spoke_vpc_b_ssm_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_b_ssm_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.spoke_vpc_b_ssm_messages_endpoint will be created
  + resource "aws_vpc_endpoint" "spoke_vpc_b_ssm_messages_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # random_string.bucket_random_id will be created
  + resource "random_string" "bucket_random_id" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 102 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + spoke_vpc_a_host_ip = (known after apply)
  + spoke_vpc_b_host_ip = (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.anfw_flow_bucket,
  on firewall.tf line 148, in resource "aws_s3_bucket" "anfw_flow_bucket":
 148: resource "aws_s3_bucket" "anfw_flow_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform\tmp\terraform.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform\\tmp\\terraform.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD